In [100]:
import pandas as pd

In [101]:
df_data = pd.read_csv('supermarket_sales.csv')

In [102]:
df_data.head()

,Invoice ID,Branch,City,Customer type,Gender,Product line,Unit price,Quantity,Tax 5%,Total,Date,Time,Payment,cogs,gross margin percentage,gross income,Rating
0,750-67-8428,A,Yangon,Member,Female,Health and beauty,74.69,7,26.1415,548.9715,1/5/2019,13:08,Ewallet,522.83,4.761905,26.1415,9.1
1,226-31-3081,C,Naypyitaw,Normal,Female,Electronic accessories,15.28,5,3.8200,80.2200,3/8/2019,10:29,Cash,76.40,4.761905,3.8200,9.6
2,631-41-3108,A,Yangon,Normal,Male,Home and lifestyle,46.33,7,16.2155,340.5255,3/3/2019,13:23,Credit card,324.31,4.761905,16.2155,7.4
3,123-19-1176,A,Yangon,Member,Male,Health and beauty,58.22,8,23.2880,489.0480,1/27/2019,20:33,Ewallet,465.76,4.761905,23.2880,8.4
4,373-73-7910,A,Yangon,Normal,Male,Sports and travel,86.31,7,30.2085,634.3785,2/8/2019,10:37,Ewallet,604.17,4.761905,30.2085,5.3

In [103]:
#Qual o faturamento total da filial?
df_data.groupby('City')[['Total', 'gross income']].sum()

                 Total  gross income
City
Mandalay   106197.6720     5057.0320
Naypyitaw  110568.7065     5265.1765
Yangon     106200.3705     5057.1605

In [104]:
#Qual a percentual de participação na receita de cada tipo de produto?
(df_data.groupby('Product line')['Total'].sum() / df_data.groupby('Product line')['Total'].sum().sum()).sort_values() * 100

Product line
Health and beauty         15.231828
Home and lifestyle        16.677232
Fashion accessories       16.814702
Electronic accessories    16.824497
Sports and travel         17.067648
Food and beverages        17.384094
Name: Total, dtype: float64

In [105]:
#Como está distribuído o tipo de produto consumido por gênero
df_data.groupby(['Product line', 'Gender'])[['Total']].sum().pivot_table(index='Product line', columns='Gender')

                             Total
Gender                      Female        Male
Product line
Electronic accessories  27102.0225  27235.5090
Fashion accessories     30437.4000  23868.4950
Food and beverages      33170.9175  22973.9265
Health and beauty       18560.9865  30632.7525
Home and lifestyle      30036.8775  23825.0355
Sports and travel       28574.7210  26548.1055

In [106]:
#Qual foi o faturamento por mês?
df_data['Date'] = pd.to_datetime(df_data['Date'])
df_data['Month'] = df_data['Date'].apply(lambda x: x.month)
df_data['Year'] = df_data['Date'].apply(lambda x: x.year)
df_data.groupby(['Month'])['Total'].sum()

Month
1    116291.868
2     97219.374
3    109455.507
Name: Total, dtype: float64

In [107]:
#Qual foi a média de avaliação por cada filial em janeiro de 2019
df_data[(df_data['Year'] == 2019) & (df_data['Month'] == 1)]['Rating'].mean()

np.float64(7.017613636363635)

In [108]:
#Como se distribui o gasto por tipo de consumidor em cada filial
df_data.groupby(['Customer type', 'City'])['Total'].sum()

Customer type  City
Member         Mandalay     53704.6860
               Naypyitaw    56881.2825
               Yangon       53637.4755
Normal         Mandalay     52492.9860
               Naypyitaw    53687.4240
               Yangon       52562.8950
Name: Total, dtype: float64

In [109]:
import numpy as np

In [110]:
labels = ['a', 'b', 'c']
minha_lista = [10, 20, 30]
arr = np.array([10, 20, 30])
d = {'a':10, 'b':20, 'c':30}

In [111]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [112]:
pd.Series(data=labels, index=minha_lista) #Poderia ter feito pd.Series(labels, minha_lista) que daria o mesmo resultado

10    a
20    b
30    c
dtype: object

In [113]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [114]:
ser1 = pd.Series([1,2,3,4],index=['EUA', 'Alemanha', 'Russia', 'Japão'])

In [115]:
ser1

EUA         1
Alemanha    2
Russia      3
Japão       4
dtype: int64

In [116]:
ser2 = pd.Series([1,2,5,4],index=['EUA', 'Alemanha', 'Italia', 'Japão'])
ser2

EUA         1
Alemanha    2
Italia      5
Japão       4
dtype: int64

In [117]:
ser1['EUA']

np.int64(1)

In [118]:
ser1[['Alemanha','Russia']]

Alemanha    2
Russia      3
dtype: int64

In [119]:
ser1 + ser2

Alemanha    4.0
EUA         2.0
Italia      NaN
Japão       8.0
Russia      NaN
dtype: float64

###DataFrames

In [120]:
from numpy.random import randn

In [121]:
df = pd.DataFrame(randn(5,4), index=['A',"B",'C','D','E'], columns='W X Y Z'.split())
df

          W         X         Y         Z
A -2.147132 -0.293760 -0.339318 -0.115140
B  0.790240  0.897361  0.000777  0.067125
C -1.770865  0.676213 -1.376723  1.434135
D -0.489988 -0.419303 -1.480929 -0.107975
E  0.329286  1.160740 -0.076534 -0.554113

In [122]:
df['W']

A   -2.147132
B    0.790240
C   -1.770865
D   -0.489988
E    0.329286
Name: W, dtype: float64

In [123]:
df[['W']]

          W
A -2.147132
B  0.790240
C -1.770865
D -0.489988
E  0.329286

In [124]:
df['new'] = df['W'] + df['Y']
df

          W         X         Y         Z       new
A -2.147132 -0.293760 -0.339318 -0.115140 -2.486451
B  0.790240  0.897361  0.000777  0.067125  0.791017
C -1.770865  0.676213 -1.376723  1.434135 -3.147588
D -0.489988 -0.419303 -1.480929 -0.107975 -1.970917
E  0.329286  1.160740 -0.076534 -0.554113  0.252751

In [125]:
df.drop('new', axis=1) #ais = 1 corresponde a colunas e axis =0 linhas

          W         X         Y         Z
A -2.147132 -0.293760 -0.339318 -0.115140
B  0.790240  0.897361  0.000777  0.067125
C -1.770865  0.676213 -1.376723  1.434135
D -0.489988 -0.419303 -1.480929 -0.107975
E  0.329286  1.160740 -0.076534 -0.554113

In [126]:
df

          W         X         Y         Z       new
A -2.147132 -0.293760 -0.339318 -0.115140 -2.486451
B  0.790240  0.897361  0.000777  0.067125  0.791017
C -1.770865  0.676213 -1.376723  1.434135 -3.147588
D -0.489988 -0.419303 -1.480929 -0.107975 -1.970917
E  0.329286  1.160740 -0.076534 -0.554113  0.252751

In [127]:
df.drop('new', axis=1, inplace=True) #retira a coluna new do arquivo original

In [128]:
df

          W         X         Y         Z
A -2.147132 -0.293760 -0.339318 -0.115140
B  0.790240  0.897361  0.000777  0.067125
C -1.770865  0.676213 -1.376723  1.434135
D -0.489988 -0.419303 -1.480929 -0.107975
E  0.329286  1.160740 -0.076534 -0.554113

In [129]:
df.loc['A']

W   -2.147132
X   -0.293760
Y   -0.339318
Z   -0.115140
Name: A, dtype: float64

In [130]:
df.loc[['A', 'B']]

          W         X         Y         Z
A -2.147132 -0.293760 -0.339318 -0.115140
B  0.790240  0.897361  0.000777  0.067125

In [131]:
df.iloc[0,2] #primeiro valor será a linha e o segundo a coluna para acessar uma célula da tabela

np.float64(-0.33931834143390727)

In [132]:
df.iloc[:-1, :]

          W         X         Y         Z
A -2.147132 -0.293760 -0.339318 -0.115140
B  0.790240  0.897361  0.000777  0.067125
C -1.770865  0.676213 -1.376723  1.434135
D -0.489988 -0.419303 -1.480929 -0.107975

In [133]:
df.iloc[1:4, 1:3]

          X         Y
B  0.897361  0.000777
C  0.676213 -1.376723
D -0.419303 -1.480929

In [134]:
df + df

          W         X         Y         Z
A -4.294265 -0.587521 -0.678637 -0.230281
B  1.580481  1.794722  0.001554  0.134250
C -3.541729  1.352425 -2.753447  2.868270
D -0.979976 -0.838606 -2.961858 -0.215950
E  0.658572  2.321480 -0.153069 -1.108226

In [135]:
df > 0

       W      X      Y      Z
A  False  False  False  False
B   True   True   True   True
C  False   True  False   True
D  False  False  False  False
E   True   True  False  False

In [136]:
df[df > 0]

          W         X         Y         Z
A       NaN       NaN       NaN       NaN
B  0.790240  0.897361  0.000777  0.067125
C       NaN  0.676213       NaN  1.434135
D       NaN       NaN       NaN       NaN
E  0.329286  1.160740       NaN       NaN

In [137]:
df['Y'] > 0

A    False
B     True
C    False
D    False
E    False
Name: Y, dtype: bool

In [138]:
df[df['X'] > 0]

          W         X         Y         Z
B  0.790240  0.897361  0.000777  0.067125
C -1.770865  0.676213 -1.376723  1.434135
E  0.329286  1.160740 -0.076534 -0.554113

In [139]:
df[(df['X'] > 0) & (df['W'] > 0)]

          W         X         Y         Z
B  0.790240  0.897361  0.000777  0.067125
E  0.329286  1.160740 -0.076534 -0.554113

In [140]:
df.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [141]:
df.columns

Index(['W', 'X', 'Y', 'Z'], dtype='object')

In [142]:
df.reset_index()

  index         W         X         Y         Z
0     A -2.147132 -0.293760 -0.339318 -0.115140
1     B  0.790240  0.897361  0.000777  0.067125
2     C -1.770865  0.676213 -1.376723  1.434135
3     D -0.489988 -0.419303 -1.480929 -0.107975
4     E  0.329286  1.160740 -0.076534 -0.554113

In [143]:
df

          W         X         Y         Z
A -2.147132 -0.293760 -0.339318 -0.115140
B  0.790240  0.897361  0.000777  0.067125
C -1.770865  0.676213 -1.376723  1.434135
D -0.489988 -0.419303 -1.480929 -0.107975
E  0.329286  1.160740 -0.076534 -0.554113

In [144]:
df.reset_index(inplace=True)
df

  index         W         X         Y         Z
0     A -2.147132 -0.293760 -0.339318 -0.115140
1     B  0.790240  0.897361  0.000777  0.067125
2     C -1.770865  0.676213 -1.376723  1.434135
3     D -0.489988 -0.419303 -1.480929 -0.107975
4     E  0.329286  1.160740 -0.076534 -0.554113

In [145]:
df.set_index("index", inplace=True)
df

              W         X         Y         Z
index
A     -2.147132 -0.293760 -0.339318 -0.115140
B      0.790240  0.897361  0.000777  0.067125
C     -1.770865  0.676213 -1.376723  1.434135
D     -0.489988 -0.419303 -1.480929 -0.107975
E      0.329286  1.160740 -0.076534 -0.554113

In [146]:
novoind = 'CA NY WY OR CO'.split()
novoind

['CA', 'NY', 'WY', 'OR', 'CO']

In [147]:
df['novo_index'] = novoind
df

              W         X         Y         Z novo_index
index
A     -2.147132 -0.293760 -0.339318 -0.115140         CA
B      0.790240  0.897361  0.000777  0.067125         NY
C     -1.770865  0.676213 -1.376723  1.434135         WY
D     -0.489988 -0.419303 -1.480929 -0.107975         OR
E      0.329286  1.160740 -0.076534 -0.554113         CO

In [153]:
df.set_index('novo_index')
df

              W         X         Y         Z novo_index
index
A     -2.147132 -0.293760 -0.339318 -0.115140         CA
B      0.790240  0.897361  0.000777  0.067125         NY
C     -1.770865  0.676213 -1.376723  1.434135         WY
D     -0.489988 -0.419303 -1.480929 -0.107975         OR
E      0.329286  1.160740 -0.076534 -0.554113         CO